# Structural Connection Handler Type Update Custom Connection Type Method

Source: https://www.revitapidocs.com/2026/bd060853-9bb7-9fa6-10aa-1aa5b86c8e5a.htm

---

| Structural Connection Handler Type Update Custom Connection Type Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static void UpdateCustomConnectionType(
	StructuralConnectionHandler structuralConnectionHandler,
	IList<Reference> addReferences,
	IList<Reference> removeReferences
)
```

```
Public Shared Sub UpdateCustomConnectionType (
	structuralConnectionHandler As StructuralConnectionHandler,
	addReferences As IList(Of Reference),
	removeReferences As IList(Of Reference)
)
```

```
public:
static void UpdateCustomConnectionType(
	StructuralConnectionHandler^ structuralConnectionHandler,
	IList<Reference^>^ addReferences,
	IList<Reference^>^ removeReferences
)
```

```
static member UpdateCustomConnectionType :
        structuralConnectionHandler : StructuralConnectionHandler *
        addReferences : IList<Reference> *
        removeReferences : IList<Reference> -> unit
```

#### Parameters

structuralConnectionHandler StructuralConnectionHandler
addReferences IList Reference
removeReferences IList Reference

See Also

#### Reference

StructuralConnectionHandlerType Class Autodesk.Revit.DB.Structure Namespace